erpdev.СХК_Расширение/src/InformationRegisters/СХК_ПользователиСклад/СХК_ПользователиСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ПользователиСклад</name>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_ПользователиСклад/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	Запись.ШтрихКод = СформироватьШтрихкодEAN13();
КонецПроцедуры


Функция СформироватьШтрихкодEAN13() Экспорт

	ПрефиксУзлаШтрихкода = ПрефиксУзлаШтрихкода();
	
	Возврат ПолучитьШтрихкодПоКоду(Запись.Пользователь.ФизическоеЛицо.ИНН,Запись.Пользователь.ФизическоеЛицо.ИНН, ПрефиксУзлаШтрихкода);

КонецФункции  

Функция ПрефиксУзлаШтрихкода() Экспорт
	
	Возврат Формат(Константы.ПрефиксШтрихкодовУзлаРИБ.Получить(),"ЧЦ=1; ЧН=; ЧВН=");
	
КонецФункции 

Функция ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода) Экспорт

	Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции  

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции  

&НаКлиенте
Процедура Печать(Команда)
	ТаблДокум = ПечатьШКНаСервере();
	ТаблДокум.Показать("Печать документа");
КонецПроцедуры   

&НаСервере
Функция ПечатьШКНаСервере()
	ТаблДокум = Новый  ТабличныйДокумент;
    ТаблДокум.Очистить();
	Макет = РегистрыСведений.СХК_ПользователиСклад.ПолучитьМакет("Макет");  
	Строка = Макет.ПолучитьОбласть("Строка");
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          112);
			ПараметрыШтрихкода.Вставить("Высота",          75);
			ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Запись.ШтрихКод));
			ПараметрыШтрихкода.Вставить("ТипКода",         2); // EAN13
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта",    16);
			                     
			Строка.Рисунки.ШтрихКод.Картинка= МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
			
    		ТаблДокум.Вывести(Строка);
		
	
	Возврат ТаблДокум;

КонецФункции
